&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СТЧ);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	СТЧ = Элементы.СписокНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СТЧ);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриИзменении(Элемент)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриУдаленииСтрок(Элемент, УдаленныеСтроки)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПослеДобавленияСтрок(Элемент, НовыеСтроки)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Показываем только услуги при выборе
	ДанныеВыбора.Отбор.Услуга.Установить(Истина);
КонецПроцедуры

&НаКлиенте
Процедура УслугиНоменклатураПриИзменении(Элемент)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СТЧ);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СТЧ);
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриУдаленииСтрок(Элемент, УдаленныеСтроки)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура УслугиПослеДобавленияСтрок(Элемент, НовыеСтроки)
	Объект.СуммаПоДокументу = Объект.СписокНоменклатуры.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры
